feniex/firm_F1-TestFixture/F1-TestFixture.cydsn/Generated_Source/PSoC5/OBDII_AUDIO_OUTPUT_CONTROL.h
/*******************************************************************************
* File Name: OBDII_AUDIO_OUTPUT_CONTROL.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_OBDII_AUDIO_OUTPUT_CONTROL_H) /* CY_CONTROL_REG_OBDII_AUDIO_OUTPUT_CONTROL_H */
#define CY_CONTROL_REG_OBDII_AUDIO_OUTPUT_CONTROL_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} OBDII_AUDIO_OUTPUT_CONTROL_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    OBDII_AUDIO_OUTPUT_CONTROL_Write(uint8 control) ;
uint8   OBDII_AUDIO_OUTPUT_CONTROL_Read(void) ;

void OBDII_AUDIO_OUTPUT_CONTROL_SaveConfig(void) ;
void OBDII_AUDIO_OUTPUT_CONTROL_RestoreConfig(void) ;
void OBDII_AUDIO_OUTPUT_CONTROL_Sleep(void) ; 
void OBDII_AUDIO_OUTPUT_CONTROL_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define OBDII_AUDIO_OUTPUT_CONTROL_Control        (* (reg8 *) OBDII_AUDIO_OUTPUT_CONTROL_Sync_ctrl_reg__CONTROL_REG )
#define OBDII_AUDIO_OUTPUT_CONTROL_Control_PTR    (  (reg8 *) OBDII_AUDIO_OUTPUT_CONTROL_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_OBDII_AUDIO_OUTPUT_CONTROL_H */


/* [] END OF FILE */
